In [1]:
import pandas as pd

In [2]:
dict1 = {
        '2015':[9940443, 3049239, 4850928, 4503200],
        '2010':[8572092, 3944003, 9905393, 2283433],
        '2005':[3822392, 2480033, 1058393, 1283033],
        '2000':[8230392, 6784003, 8805393, 3283433],
        '지역':['수도권', '경상권', '수도권', '경상권'],
        '증가율':[0.0234, 0.0384, 0.08574, 0.0234]
        }

option1 = ['지역', '2000', '2005', '2010', '2015', '증가율']
option2 = ['서울', '부산', '인천', '대구']

df1 = pd.DataFrame(dict1, columns=option1, index=option2)
df1

     지역     2000     2005     2010     2015      증가율
서울  수도권  8230392  3822392  8572092  9940443  0.02340
부산  경상권  6784003  2480033  3944003  3049239  0.03840
인천  수도권  8805393  1058393  9905393  4850928  0.08574
대구  경상권  3283433  1283033  2283433  4503200  0.02340

### 데이터 접근

In [3]:
df1['지역']

서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [4]:
df1['2015']

서울    9940443
부산    3049239
인천    4850928
대구    4503200
Name: 2015, dtype: int64

### 데이터 셋팅

In [5]:
df1['2000'] = 1000
df1

     지역  2000     2005     2010     2015      증가율
서울  수도권  1000  3822392  8572092  9940443  0.02340
부산  경상권  1000  2480033  3944003  3049239  0.03840
인천  수도권  1000  1058393  9905393  4850928  0.08574
대구  경상권  1000  1283033  2283433  4503200  0.02340

In [6]:
df1['2005'] = df1['2005'] + 1000 # 해당되는 값 끄집어내서 연산하고 다시 넣는다. 이후 덥어씌운다. (값 새롭게 셋팅)
df1

     지역  2000     2005     2010     2015      증가율
서울  수도권  1000  3823392  8572092  9940443  0.02340
부산  경상권  1000  2481033  3944003  3049239  0.03840
인천  수도권  1000  1059393  9905393  4850928  0.08574
대구  경상권  1000  1284033  2283433  4503200  0.02340

In [7]:
# 존재하지 않는 특성의 이름을 통해 값을 넣어주면 특성이 추가된다.
df1['2010 ~ 2015 증가수'] = df1['2015'] - df1['2010'] 
df1

     지역  2000     2005     2010     2015      증가율  2010 ~ 2015 증가수
서울  수도권  1000  3823392  8572092  9940443  0.02340          1368351
부산  경상권  1000  2481033  3944003  3049239  0.03840          -894764
인천  수도권  1000  1059393  9905393  4850928  0.08574         -5054465
대구  경상권  1000  1284033  2283433  4503200  0.02340          2219767

In [8]:
# 제거도 한꺼번에 가능
# 하지만 일단 하나만 제거해보자.
del df1['2000']

### 인덱스

In [9]:
dict1 = {
        '2015':[9940443, 3049239, 4850928, 4503200],
        '2010':[8572092, 3944003, 9905393, 2283433],
        '2005':[3822392, 2480033, 1058393, 1283033],
        '2000':[8230392, 6784003, 8805393, 3283433],
        '지역':['수도권', '경상권', '수도권', '경상권'],
        '증가율':[0.0234, 0.0384, 0.08574, 0.0234]
        }

option1 = ['지역', '2000', '2005', '2010', '2015', '증가율']
option2 = ['서울', '부산', '인천', '대구']

df1 = pd.DataFrame(dict1, columns=option1, index=option2)
df1

     지역     2000     2005     2010     2015      증가율
서울  수도권  8230392  3822392  8572092  9940443  0.02340
부산  경상권  6784003  2480033  3944003  3049239  0.03840
인천  수도권  8805393  1058393  9905393  4850928  0.08574
대구  경상권  3283433  1283033  2283433  4503200  0.02340

In [10]:
# 시리즈 하나를 가져온다.
# 특성 하나의 데이터를 데이터프레임으로 가져온다.
df1[['2000']]

       2000
서울  8230392
부산  6784003
인천  8805393
대구  3283433

In [11]:
# 여러 특성을 리스트로 담아 지정하라ㅕㅁㄴ 그 특성들이 이ㅆ는 데이터 프레임을 생성해서 반환한다.
df1[['2000','2005','2015']]

       2000     2005     2015
서울  8230392  3822392  9940443
부산  6784003  2480033  3049239
인천  8805393  1058393  4850928
대구  3283433  1283033  4503200

In [12]:
# 존재하지 않는 특성의 이름을 사용하면 오류가 발생한다.
df1['2200']

KeyError: '2200'

In [13]:
# 특성의 이름이 문자열로 되어있는 경우 인덱스 번호를 사용하면 오류가 발생한다.
# df1[0]

In [14]:
import numpy as np

In [22]:
df2 = pd.DataFrame(np.arange(12).reshape(2,6))
df2

   0  1  2  3   4   5
0  0  1  2  3   4   5
1  6  7  8  9  10  11

In [23]:
df2[0] # 특성을 뽑아내는 중

0    0
1    6
Name: 0, dtype: int32

In [25]:
df2[2]

0    2
1    8
Name: 2, dtype: int32

In [26]:
# 행을 뽑아봅시다.
df2[[0,1,2]]

   0  1  2
0  0  1  2
1  6  7  8

In [27]:
df2[[0]] # 하나면 시리즈, 하나 이상이면 데이터프레임

   0
0  0
1  6

### 행 인덱싱

In [28]:
dict1 = {
        '2015':[9940443, 3049239, 4850928, 4503200],
        '2010':[8572092, 3944003, 9905393, 2283433],
        '2005':[3822392, 2480033, 1058393, 1283033],
        '2000':[8230392, 6784003, 8805393, 3283433],
        '지역':['수도권', '경상권', '수도권', '경상권'],
        '증가율':[0.0234, 0.0384, 0.08574, 0.0234]
        }

option1 = ['지역', '2000', '2005', '2010', '2015', '증가율']
option2 = ['서울', '부산', '인천', '대구']

df1 = pd.DataFrame(dict1, columns=option1, index=option2)
df1

     지역     2000     2005     2010     2015      증가율
서울  수도권  8230392  3822392  8572092  9940443  0.02340
부산  경상권  6784003  2480033  3944003  3049239  0.03840
인천  수도권  8805393  1058393  9905393  4850928  0.08574
대구  경상권  3283433  1283033  2283433  4503200  0.02340

In [29]:
df1[:0] # 데이터프레임 구조니까 아무것도 못가져옴에도 출력이 된다.

Empty DataFrame
Columns: [지역, 2000, 2005, 2010, 2015, 증가율]
Index: []

In [30]:
#0 ~ 1 -1 
df1[:1]

     지역     2000     2005     2010     2015     증가율
서울  수도권  8230392  3822392  8572092  9940443  0.0234

In [31]:
# 1 ~ 2 - 1
df1[1:2]

     지역     2000     2005     2010     2015     증가율
부산  경상권  6784003  2480033  3944003  3049239  0.0384

In [32]:
# 1 ~ 3 -1
df1[1:3]

     지역     2000     2005     2010     2015      증가율
부산  경상권  6784003  2480033  3944003  3049239  0.03840
인천  수도권  8805393  1058393  9905393  4850928  0.08574

In [33]:
df1['서울':'대구']

     지역     2000     2005     2010     2015      증가율
서울  수도권  8230392  3822392  8572092  9940443  0.02340
부산  경상권  6784003  2480033  3944003  3049239  0.03840
인천  수도권  8805393  1058393  9905393  4850928  0.08574
대구  경상권  3283433  1283033  2283433  4503200  0.02340

In [34]:
# 행, 렬
df1['2015']['서울']

9940443

In [35]:
df1['2015']['서울':'대구']

서울    9940443
부산    3049239
인천    4850928
대구    4503200
Name: 2015, dtype: int64

In [36]:
# df1. ['2000':'2015']['서울':'대구'] # 특성의 이름은 범위 설정이 불가능할 확률이 크다.
df1[['2000','2005','2010','2015']]['서울':'대구']  # 열 , 행 순서이다.


# 행렬 개념보다 테이블 개념으로 이해하면 이해가 쉽다.!!!

       2000     2005     2010     2015
서울  8230392  3822392  8572092  9940443
부산  6784003  2480033  3944003  3049239
인천  8805393  1058393  9905393  4850928
대구  3283433  1283033  2283433  4503200

### 정리합시다.
- df1['이름'] : 특성을 가져온다. 결과 =>  시리즈로 나온다.
- df1[['이름1', '이름2']] : 특성들을 가져온다. 결과 => 데이터프레임으로 나온다.

- df1[숫자] : 특성을 가져온다.만약 특성의 이름이 문자열로 되어있다면 오류난다.


- df1[숫자:숫자] : 열을 가져온다.
- df1['이름1':'이름2'] : 행을 가져온다.

- df1[특성][행] : 특정 특성들 중에 특정 행들을 가져온다.

### 문제
다음 데이터 프레임을 이용해 제시된 문제를 풀어보세요.
- 모든 학생의 수학 점수를 시리즈로 가져온다.
- 모든 학생의 국어, 영어 점수를 데이터 프레임으로 가져온다.
- 모든 학생의 각 과목  평균 점수를 새로운 열로 추가한다.
- 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
- 춘향의 점수를 데이터프레임으로 가져온다.
- 향단의 점수를 시리즈로 가져온다.

In [37]:
data100 = {
    '국어' : [80, 90, 70, 30],
    '영어' : [90, 70, 60, 40],
    '수학' : [90, 60, 80, 70],
}

option1 = ['춘향', '몽룡', '향단', '방자']
df100 = pd.DataFrame(data100, index=option1)
df100

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [38]:
# 모든 학생의 수학 점수를 시리즈로 가져온다.
df100['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [39]:
# 모든 학생의 국어, 영어 점수를 데이터 프레임으로 가져온다.
df100[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [40]:
# 모든 학생의 각 과목  평균 점수를 새로운 열로 추가한다.
df100['평균'] = (df100['국어'] + df100['영어'] + df100['수학']) // 3
df100

    국어  영어  수학  평균
춘향  80  90  90  86
몽룡  90  70  60  73
향단  70  60  80  70
방자  30  40  70  46

In [41]:
# 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df100['영어']['방자'] = 80
df100['평균'] = (df100['국어'] + df100['영어'] + df100['수학']) // 3
df100

    국어  영어  수학  평균
춘향  80  90  90  86
몽룡  90  70  60  73
향단  70  60  80  70
방자  30  80  70  60

In [42]:
# 춘향의 점수를 데이터프레임으로 가져온다.
df100[:'춘향']

    국어  영어  수학  평균
춘향  80  90  90  86

In [43]:
# 향단의 점수를 시리즈로 가져온다.
df100['향단':'향단'].values

array([[70, 60, 80, 70]], dtype=int64)